{"speaker-jens-ravens":{"firstname":"Jens","lastname":"Ravens","bio_html":"Jens is an iOS, macOS and backend Developer, writing ObjC since 2006. Currently working at nerdgeschoss helping clients to create awesome apps. Organiser of the monthly swift.berlin meetup. Scaring people with functional concepts since 2014.","www":"","twitter":"https://twitter.com/jensravens","facebook":"","github":"","linkedin":"","photo_url":"/images/speakers/jens-ravens.jpg"},"speaker-pedro-buendia":{"firstname":"Pedro","lastname":"Buendia","bio_html":"Pedro is an iOS Developer at SoundCloud. Open source lover and runner in his free time. He loves coding and contributing with his own libraries. In his spare time, Pedro is starting his own project, GitDo. Open to learning new concepts and paradigms, of late he is interested in architectures like VIPER, and reactive programming.","www":"","twitter":"","photo_url":"/images/speakers/pedro-buendia.png"},"speaker-konstantin-raev":{"firstname":"Konstantin","lastname":"Raev","bio_html":"Konstantin is a Developer at Facebook who is working in React Native team. For the last few years his passions were infrastructure, Continuous Delivery, JavaScript and stable builds. Before joining Facebook he worked at a New Zealand startup <a href='www.booktrack.com'>Booktrack</a>.","wwww":"","twitter":"https://twitter.com/bestander_nz","photo_url":"/images/speakers/konstantin-raev.png"},"speaker-pawel-gajda":{"firstname":"Gautier","lastname":"Mechling","bio_html":"Gautier is an aspiring Software Craftsman in Paris, France. Agile thinker passionate in Android Development, he creates and maintains some FOSS tools to improve productivity. Talk to him about Kotlin, Clean Code, or Free Software and you will see his eyes light up.","wwww":"","twitter":"https://twitter.com/Nilhcem","photo_url":"/images/speakers/gautier-mechling.png"},"speaker-nicola-zaghini":{"firstname":"Nicola","lastname":"Zaghini","bio_html":"Nicola Zaghini is a software architect at Mobile Travel Technologies. He has been developing mobile apps since the first iOS SDK was released, from indie game development to major airlines and travel companies. Prior to that, he enjoyed Java development as professional and researcher in academia. He is currently in charge of mobile architecture in MTT and helps teams deliver amazing apps.","www":"","twitter":"https://twitter.com/nzaghini","photo_url":"/images/speakers/nicola-zaghini.png"},"speaker-roberto-orgiu":{"firstname":"Roberto","lastname":"Orgiu","bio_html":"Android developer and enthusiastic, DroidCon and community fan, I love the Android environment and pushing the limits of the platform.","www":"","twitter":"","photo_url":"/images/speakers/roberto-orgiu.png"},"speaker-eric-kok":{"firstname":"Eric","lastname":"Kok","bio_html":"Hi, I'm Eric. I currently work as a contractor at KBC Bank in Belgium creating the next mobile banking app. But if you know me, it is through my open-source work published under the 2312 development name. I build apps, such as RateBeer, and libraries, such as RxCupboard. I love brewing and drinking craft beer, chatting about Android and building with Legos with my son.","www":"","twitter":"","photo_url":"/images/speakers/eric-kok.png"},"speaker-dan-cuello":{"firstname":"Dan","lastname":"Cuellar","bio_html":"Dan Cuellar is the creator of the open source mobile automation framework Appium, and Head of Test Engineering at FOODit in London. Previously, he headed the test organisation at Shazam in London and Zoosk in San Francisco, and worked as a software engineer on Microsoft Outlook for Mac, and other products in the Microsoft Office suite. He is an advocate of open source technologies and technical software testing. He earned a Bachelor’s degree in Computer Science, with a minor in Music Technology, from the world-renowned School of Computer Science at Carnegie Mellon University in Pittsburgh.","www":"","twitter":"","photo_url":"/images/speakers/dan-cuellar.png"},"speaker-roman-mazur":{"firstname":"Roman","lastname":"Mazur","bio_html":"Roman has been working with Android for more than 6 years. You can find him delivering fixes and new features to a plenty of Android libraries and frameworks including support library, Robolectric, Madge, Spoon, Retrofit, and Helium. At Stanfy he is working on a customized Android OS for in-room tablets installed at hotels by KEYPR.","www":"","twitter":"","photo_url":"/images/speakers/roman-mazur.png"},"speaker-markus-junginger":{"firstname":"Markus","lastname":"Junginger","bio_html":"Markus Junginger is an Android enthusiast and developer since the first SDK release in 2007. His mobile software company greenrobot focuses on high quality Android apps and open source libraries, which are widely used by many popular apps. Markus has 15+ years experience with Java and did his first mobile software project in 2001. He regularly speaks and writes about Android, gives Android trainings, and develops for Android.","www":"","twitter":"","photo_url":"/images/speakers/markus-junginger.png"},"speaker-madis-pink":{"firstname":"Madis","lastname":"Pink","bio_html":"Madis is currently working on JRebel for Android at ZeroTurnaround. He started hacking on Android apps on a T-Mobile G1 more than 7 years ago and quickly grew a particular interest in build systems and developer tooling. His previous experience includes working on the Android Platform team at Spotify and producing multiple apps at Mobi Lab. During his free time he likes to dabble around with guitars and home recording.","www":"","github":"https://github.com/madisp","twitter":"https://twitter.com/madisp","photo_url":"/images/speakers/madis-pink.png"},"speaker-pablo-guardiola":{"firstname":"Pablo","lastname":"Guardiola","bio_html":"I'm a Software Engineer, lover of new technologies, passionate about challenges and motivated to continue learning current coding languages and methodologies. I'm a regular attendee at developers’ events and meetups. I'm a Testing-lover and I try to share my knowledge collaborating @AprendiendoTDD and @theEvnt facilitating coding dojos, katas and other stuff.","www":"http://pguardiola.com/","twitter":"https://twitter.com/guardiola31337","photo_url":"/images/speakers/pablo-guardiola.png"},"speaker-jorge-castillo":{"firstname":"Jorge","lastname":"Castillo","bio_html":"Jorge Castillo is a spanish experienced Android developer currently working as an Android Engineer at Jobandtalent, an important International product company from Madrid. Its main work is focused on Open Source projects.","www":"http://jorgecastillo.xyz/","twitter":"https://twitter.com/JorgeCastilloPr","github":"https://github.com/JorgeCastilloPrz/","photo_url":"/images/speakers/jorge-castillo.png"}}